In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [8]:
!wget 'https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv' week_3.csv

--2025-10-14 15:22:56--  https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.110.133, 185.199.108.133, 185.199.109.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.110.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 80876 (79K) [text/plain]
Saving to: ‘course_lead_scoring.csv’

course_lead_scoring 100%[===================>]  78.98K   517KB/s    in 0.2s

2025-10-14 15:22:58 (517 KB/s) - ‘course_lead_scoring.csv’ saved [80876/80876]

--2025-10-14 15:22:58--  http://week_3.csv/
Resolving week_3.csv (week_3.csv)... failed: Name or service not known.
wget: unable to resolve host address ‘week_3.csv’
FINISHED --2025-10-14 15:22:58--
Total wall clock time: 1.5s
Downloaded: 1 files, 79K in 0.2s (517 KB/s)

In [10]:
df = pd.read_csv('course_lead_scoring.csv')
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [11]:
df.head().T

,0,1,2,3,4
lead_source,paid_ads,social_media,events,paid_ads,referral
industry,NaN,retail,healthcare,retail,education
number_of_courses_viewed,1,1,5,2,3
annual_income,79450.0,46992.0,78796.0,83843.0,85012.0
employment_status,unemployed,employed,unemployed,NaN,self_employed
location,south_america,south_america,australia,australia,europe
interaction_count,4,1,3,1,3
lead_score,0.94,0.8,0.69,0.87,0.62
converted,1,0,1,0,1

In [13]:
df.describe()

,number_of_courses_viewed,annual_income,interaction_count,lead_score,converted
count,1462.000000,1281.000000,1462.000000,1462.000000,1462.000000
mean,2.031464,59886.273224,2.976744,0.506108,0.619015
std,1.449717,15070.140389,1.681564,0.288465,0.485795
min,0.000000,13929.000000,0.000000,0.000000,0.000000
25%,1.000000,49698.000000,2.000000,0.262500,0.000000
50%,2.000000,60148.000000,3.000000,0.510000,1.000000
75%,3.000000,69639.000000,4.000000,0.750000,1.000000
max,9.000000,109899.000000,11.000000,1.000000,1.000000

In [14]:
df

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1
...,...,...,...,...,...,...,...,...,...
1457,referral,manufacturing,1,NaN,self_employed,north_america,4,0.53,1
1458,referral,technology,3,65259.0,student,europe,2,0.24,1
1459,paid_ads,technology,1,45688.0,student,north_america,3,0.02,1
1460,referral,NaN,5,71016.0,self_employed,north_america,0,0.25,1
1461,organic_search,finance,3,92855.0,student,north_america,3,0.41,1

In [15]:
df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [16]:
df.describe(include='object')

           lead_source industry employment_status       location
count             1334     1328              1362           1399
unique               5        7                 4              7
top     organic_search   retail     self_employed  north_america
freq               282      203               352            225

In [17]:
categorical_columns = list(df.dtypes[df.dtypes == 'object'].index)

In [18]:
categorical_columns

['lead_source', 'industry', 'employment_status', 'location']

In [19]:
numerical_columns = list(df.dtypes[df.dtypes != 'object'].index)

In [21]:
numerical_columns = ['number_of_courses_viewed', 'annual_income', 'interaction_count', 'lead_score']

In [22]:
numerical_columns

['number_of_courses_viewed',
 'annual_income',
 'interaction_count',
 'lead_score']

In [25]:
for n in numerical_columns:
    df[n] = df[n].fillna(0)

In [26]:
df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income                 0
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [27]:
for c in categorical_columns:
    df[c] = df[c].fillna('NA')

In [28]:
df.isnull().sum()

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [30]:
df['industry'].describe()

count              1462
unique                8
top       north_america
freq                225
Name: location, dtype: object

In [34]:
df['industry'].describe()

count       1462
unique         8
top       retail
freq         203
Name: industry, dtype: object

In [36]:
industry_mode = df['industry'].mode()[0]
industry_mode

'retail'

In [37]:
df[numerical_columns].corrwith(df.converted).abs()

number_of_courses_viewed    0.435914
annual_income               0.053131
interaction_count           0.374573
lead_score                  0.193673
dtype: float64

In [38]:
correlation_matrix = df[numerical_columns].corr()
print("Correlation Matrix:")
print(correlation_matrix)

Correlation Matrix:
                          number_of_courses_viewed  annual_income  \
number_of_courses_viewed                  1.000000       0.009770
annual_income                             0.009770       1.000000
interaction_count                        -0.023565       0.027036
lead_score                               -0.004879       0.015610

                          interaction_count  lead_score
number_of_courses_viewed          -0.023565   -0.004879
annual_income                      0.027036    0.015610
interaction_count                  1.000000    0.009888
lead_score                         0.009888    1.000000

In [39]:
# Find the pair with the highest absolute correlation (excluding diagonal)
correlation_pairs = []
for i in range(len(numerical_columns)):
    for j in range(i+1, len(numerical_columns)):
        feature1 = numerical_columns[i]
        feature2 = numerical_columns[j]
        corr_value = correlation_matrix.loc[feature1, feature2]
        correlation_pairs.append((feature1, feature2, corr_value, abs(corr_value)))

# Sort by absolute correlation to find the strongest relationship
correlation_pairs_sorted = sorted(correlation_pairs, key=lambda x: x[3], reverse=True)

print("\nCorrelation pairs sorted by strength:")
for pair in correlation_pairs_sorted:
    print(f"{pair[0]} & {pair[1]}: {pair[2]:.4f}")

# Get the pair with the highest correlation
strongest_pair = correlation_pairs_sorted[0]
print(f"\nThe two features with the biggest correlation are: {strongest_pair[0]} and {strongest_pair[1]}")
print(f"Correlation coefficient: {strongest_pair[2]:.4f}")

Correlation pairs sorted by strength:
annual_income & interaction_count: 0.0270
number_of_courses_viewed & interaction_count: -0.0236
annual_income & lead_score: 0.0156
interaction_count & lead_score: 0.0099
number_of_courses_viewed & annual_income: 0.0098
number_of_courses_viewed & lead_score: -0.0049

The two features with the biggest correlation are: annual_income and interaction_count
Correlation coefficient: 0.0270